<script lang="ts">
	import { urlScheduleSource, urlSheduleDocument } from "@lib/paths";
	import { ACTUAL_DATA, currentYear, title } from "@lib/constants";
	import styles from "./about.module.css";
</script>

<section id="about" class="{styles.root}">
	<h2>Общая информация</h2>
	<p>"{title}" — веб приложение, позволяющие получать необходимую информацию для фотографа, находящемуся в городе Санкт-Петербург: актуальное расписание переключения городской подсветки, время заката и восхода Солнца и Луны.</p>
	<p>Для настоящего времени информация представлена в виде временной шкалы во вкладке "События". Помимо этого имеется возможность получить необходимую информацию на любую дату.</p>
	<p>Веб-приложение поддерживает установку как отдельное приложение в формате <a href="https://ru.wikipedia.org/wiki/%D0%9F%D1%80%D0%BE%D0%B3%D1%80%D0%B5%D1%81%D1%81%D0%B8%D0%B2%D0%BD%D0%BE%D0%B5_%D0%B2%D0%B5%D0%B1-%D0%BF%D1%80%D0%B8%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5">Progressive Web Application</a>, не требует никаких прав, работает без сети интернет и потребляет мало ресурсов.</p>
	<h2>События</h2>
	<p>Здесь представлена вся актуальная информация на следующие три дня в форме временной шкалы, включая текущие сутки.</p>
	<h2>Городское освещение</h2>
	<p>Здесь представлена информация о переключении городской подсветки в городе Санкт-Петербург.</p>
	<p>Во вкладке представлен таймер, отсчитывающий до следующего переключения наружного освещения, а так же виджет для получения расписания на любую интересующую дату.</p>
	<p>Веб-приложение использует данные о <a target="_blank" href="{urlScheduleSource}"> графике наружного освещения в Санкт-Петербурге</a> на <a target="_blank" href="{urlSheduleDocument}">{currentYear} год</a>.</p>
	<p>Данный график составлен с учётом фактических атмосферных условий Санкт-Петербурга. Включение и отключение наружного освещения, по информации составителей, разрешается с отклонением от графика на плюс-минус 30 минут.</p>
	<h3>Актуальность расписания</h3>
	{#if ACTUAL_DATA}
		<p>Используется актуальное расписание на текущий <strong>{currentYear}</strong> год.</p>
	{:else}
		<p>Расписание на текущий <strong>{currentYear}</strong> год не актуально. Пожалуйста, постучитесь к автору и попросите обновить данные.</p>
		<p>Для отображения данных будет использоваться последнее имеющееся расписание за {currentYear} год. Обычно ежегодные изменения не претерпевают заметных изменений, поэтому пользоваться ими всё равно в большей степени безопасно.</p>
	{/if}
	<h2>Эфемериды</h2>
	<p>Здесь представлена информация о времени захода и восхода Солнца и Луны в городе Санкт-Петербург. Для расчётов использовался пакет <a href="https://www.npmjs.com/package/suncalc3">SunCalc</a>. Благодаря нему расчёты происходят полностью на устройстве и не требуют подключения к сети интернет.</p>
	<h2>Пояснения</h2>
	<p>В разделе <strong>Эфемериды</strong> и <strong>Освещение</strong> для визуализации данных используется "пончиковая" диаграмма. Важно понимать, что она отображает данные о времени событий за конкретные сутки. Иногда те или иные события охватывают несколько суток, например, Луна взошла сегодня, а зайдёт за горизонт только завтра. В таких случаях на диаграмме появляется вертикальный отрезок, рассекающий шкалу; это даёт понять, что события уходят за пределы рассматриваемых суток.</p>
</section>
